librbd_iscsi/yujiang/randwrite/logs/fio-iscsi-1m.fio.log
lv0: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;91845632;153058;149;600068;32;2803;146.886657;42.622860;26190;2003957;106889.908860;57308.926969;1.000000%=50069;5.000000%=59506;10.000000%=65273;20.000000%=73924;30.000000%=81264;40.000000%=87556;50.000000%=94896;60.000000%=103284;70.000000%=112721;80.000000%=126353;90.000000%=154140;95.000000%=189792;99.000000%=312475;99.500000%=387973;99.900000%=700448;99.950000%=977272;99.990000%=1400897;0%=0;0%=0;0%=0;26333;2004127;107037.480673;57308.573209;6144;223232;99.982843%;153031.739167;32915.275597;1.423341%;1.121541%;88159;0;4169;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.03%;55.66%;41.18%;1.92%;0.13%;0.03%;0.05%;0.01%

lv0: (groupid=0, jobs=1): err= 0: pid=3997321: Thu May 21 14:56:42 2020
  write: IOPS=149, BW=149MiB/s (157MB/s)(87.6GiB/600068msec)
    slat (usec): min=32, max=2803, avg=146.89, stdev=42.62
    clat (msec): min=26, max=2003, avg=106.89, stdev=57.31
     lat (msec): min=26, max=2004, avg=107.04, stdev=57.31
    clat percentiles (msec):
     |  1.00th=[   51],  5.00th=[   60], 10.00th=[   66], 20.00th=[   74],
     | 30.00th=[   82], 40.00th=[   88], 50.00th=[   95], 60.00th=[  104],
     | 70.00th=[  113], 80.00th=[  127], 90.00th=[  155], 95.00th=[  190],
     | 99.00th=[  313], 99.50th=[  388], 99.90th=[  701], 99.95th=[  978],
     | 99.99th=[ 1401]
   bw (  KiB/s): min= 6144, max=223232, per=99.98%, avg=153031.74, stdev=32915.28, samples=1200
   iops        : min=    6, max=  218, avg=149.41, stdev=32.16, samples=1200
  lat (msec)   : 50=1.03%, 100=55.66%, 250=41.18%, 500=1.92%, 750=0.13%
  lat (msec)   : 1000=0.03%, 2000=0.05%, >=2000=0.01%
  cpu          : usr=1.42%, sys=1.12%, ctx=88159, majf=0, minf=4169
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,89693,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=149MiB/s (157MB/s), 149MiB/s-149MiB/s (157MB/s-157MB/s), io=87.6GiB (94.0GB), run=600068-600068msec