librbd_iscsi/yujiang/randwrite/logs/fio-iscsi-256k.fio.log
lv0: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;83290880;138807;542;600044;8;404;43.518792;14.032636;3792;1559274;29459.766642;30730.909084;1.000000%=5013;5.000000%=7110;10.000000%=9633;20.000000%=13041;30.000000%=15794;40.000000%=18743;50.000000%=22151;60.000000%=26345;70.000000%=32112;80.000000%=41156;90.000000%=56885;95.000000%=70778;99.000000%=120061;99.500000%=158334;99.900000%=312475;99.950000%=484442;99.990000%=1115684;0%=0;0%=0;0%=0;3822;1559317;29503.818729;30731.075729;3072;243712;100.000000%;138911.259383;34818.148458;1.385067%;2.031854%;287763;0;14;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;10.99%;32.96%;42.42%;11.94%;1.53%;0.10%;0.03%;0.01%;0.01%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3989104: Thu May 21 14:46:41 2020
  write: IOPS=542, BW=136MiB/s (142MB/s)(79.4GiB/600044msec)
    slat (usec): min=8, max=404, avg=43.52, stdev=14.03
    clat (msec): min=3, max=1559, avg=29.46, stdev=30.73
     lat (msec): min=3, max=1559, avg=29.50, stdev=30.73
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   10], 20.00th=[   14],
     | 30.00th=[   16], 40.00th=[   19], 50.00th=[   23], 60.00th=[   27],
     | 70.00th=[   33], 80.00th=[   42], 90.00th=[   57], 95.00th=[   71],
     | 99.00th=[  121], 99.50th=[  159], 99.90th=[  313], 99.95th=[  485],
     | 99.99th=[ 1116]
   bw (  KiB/s): min= 3072, max=243712, per=100.00%, avg=138911.26, stdev=34818.15, samples=1199
   iops        : min=   12, max=  952, avg=542.59, stdev=136.00, samples=1199
  lat (msec)   : 4=0.01%, 10=10.99%, 20=32.96%, 50=42.42%, 100=11.94%
  lat (msec)   : 250=1.53%, 500=0.10%, 750=0.03%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.39%, sys=2.03%, ctx=287763, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,325355,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=136MiB/s (142MB/s), 136MiB/s-136MiB/s (142MB/s-142MB/s), io=79.4GiB (85.3GB), run=600044-600044msec