librbd_iscsi/yujiang/randwrite/logs/fio-iscsi-4k.fio.log
lv0: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;9231180;15385;3846;600009;1;973;9.322208;6.225187;1063;592084;4147.683475;9331.193544;1.000000%=1548;5.000000%=1728;10.000000%=1826;20.000000%=1941;30.000000%=2039;40.000000%=2146;50.000000%=2244;60.000000%=2342;70.000000%=2506;80.000000%=2801;90.000000%=9502;95.000000%=17432;99.000000%=21889;99.500000%=27394;99.900000%=131596;99.950000%=206569;99.990000%=371195;0%=0;0%=0;0%=0;1123;592110;4157.275620;9331.853831;112;29716;100.000000%;15402.693333;9302.370553;1.991140%;5.195264%;2099063;0;16;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;24.96%;61.30%;3.95%;7.71%;1.89%;0.07%;0.10%;0.02%;0.01%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3964855: Thu May 21 14:16:39 2020
  write: IOPS=3846, BW=15.0MiB/s (15.8MB/s)(9015MiB/600009msec)
    slat (nsec): min=1830, max=973347, avg=9322.21, stdev=6225.19
    clat (usec): min=1063, max=592084, avg=4147.68, stdev=9331.19
     lat (usec): min=1123, max=592110, avg=4157.28, stdev=9331.85
    clat percentiles (usec):
     |  1.00th=[  1549],  5.00th=[  1729], 10.00th=[  1827], 20.00th=[  1942],
     | 30.00th=[  2040], 40.00th=[  2147], 50.00th=[  2245], 60.00th=[  2343],
     | 70.00th=[  2507], 80.00th=[  2802], 90.00th=[  9503], 95.00th=[ 17433],
     | 99.00th=[ 21890], 99.50th=[ 27395], 99.90th=[131597], 99.95th=[206570],
     | 99.99th=[371196]
   bw (  KiB/s): min=  112, max=29716, per=100.00%, avg=15402.69, stdev=9302.37, samples=1200
   iops        : min=   28, max= 7429, avg=3850.63, stdev=2325.57, samples=1200
  lat (msec)   : 2=24.96%, 4=61.30%, 10=3.95%, 20=7.71%, 50=1.89%
  lat (msec)   : 100=0.07%, 250=0.10%, 500=0.02%, 750=0.01%
  cpu          : usr=1.99%, sys=5.20%, ctx=2099063, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2307795,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=15.0MiB/s (15.8MB/s), 15.0MiB/s-15.0MiB/s (15.8MB/s-15.8MB/s), io=9015MiB (9453MB), run=600009-600009msec