librbd_iscsi/yujiang/randwrite/logs/fio-iscsi-4m.fio.log
lv0: (g=0): rw=randwrite, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;66969600;111520;27;600513;188;9241;526.361444;252.765816;71403;2227678;587091.529168;177991.195846;1.000000%=333447;5.000000%=379584;10.000000%=404750;20.000000%=446693;30.000000%=480247;40.000000%=513802;50.000000%=549453;60.000000%=591396;70.000000%=641728;80.000000%=708837;90.000000%=809500;95.000000%=918552;99.000000%=1182793;99.500000%=1333788;99.900000%=1686110;99.950000%=1769996;99.990000%=1954545;0%=0;0%=0;0%=0;71598;2228247;587618.889541;177985.889702;8192;221184;100.000000%;111856.258145;32249.304616;0.952521%;0.564851%;16439;0;32814;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;36.01%;49.23%;11.90%;2.81%;0.01%

lv0: (groupid=0, jobs=1): err= 0: pid=4004702: Thu May 21 15:06:43 2020
  write: IOPS=27, BW=109MiB/s (114MB/s)(63.9GiB/600513msec)
    slat (usec): min=188, max=9241, avg=526.36, stdev=252.77
    clat (msec): min=71, max=2227, avg=587.09, stdev=177.99
     lat (msec): min=71, max=2228, avg=587.62, stdev=177.99
    clat percentiles (msec):
     |  1.00th=[  334],  5.00th=[  380], 10.00th=[  405], 20.00th=[  447],
     | 30.00th=[  481], 40.00th=[  514], 50.00th=[  550], 60.00th=[  592],
     | 70.00th=[  642], 80.00th=[  709], 90.00th=[  810], 95.00th=[  919],
     | 99.00th=[ 1183], 99.50th=[ 1334], 99.90th=[ 1687], 99.95th=[ 1770],
     | 99.99th=[ 1955]
   bw (  KiB/s): min= 8192, max=221184, per=100.00%, avg=111856.26, stdev=32249.30, samples=1197
   iops        : min=    2, max=   54, avg=27.24, stdev= 7.88, samples=1197
  lat (msec)   : 100=0.01%, 250=0.02%, 500=36.01%, 750=49.23%, 1000=11.90%
  lat (msec)   : 2000=2.81%, >=2000=0.01%
  cpu          : usr=0.95%, sys=0.56%, ctx=16439, majf=0, minf=32814
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,16350,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=109MiB/s (114MB/s), 109MiB/s-109MiB/s (114MB/s-114MB/s), io=63.9GiB (68.6GB), run=600513-600513msec