librbd_iscsi/yujiang/randwrite/logs/fio-iscsi-64k.fio.log
lv0: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;49998656;83325;1301;600042;2;336;17.926908;8.436356;1884;621648;12267.433400;16252.776763;1.000000%=2539;5.000000%=2768;10.000000%=2932;20.000000%=3260;30.000000%=3751;40.000000%=5210;50.000000%=8716;60.000000%=12124;70.000000%=15400;80.000000%=18481;90.000000%=24248;95.000000%=28966;99.000000%=60030;99.500000%=76021;99.900000%=185597;99.950000%=316669;99.990000%=541065;0%=0;0%=0;0%=0;1896;621675;12285.722000;16253.128572;768;168320;99.996016%;83321.680000;27333.022439;1.353907%;2.849472%;699338;0;1725;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;32.71%;20.61%;29.94%;15.16%;1.30%;0.22%;0.04%;0.02%;0.00%;0.00%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3980544: Thu May 21 14:36:40 2020
  write: IOPS=1301, BW=81.4MiB/s (85.3MB/s)(47.7GiB/600042msec)
    slat (usec): min=2, max=336, avg=17.93, stdev= 8.44
    clat (usec): min=1884, max=621648, avg=12267.43, stdev=16252.78
     lat (usec): min=1896, max=621675, avg=12285.72, stdev=16253.13
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    6], 50.00th=[    9], 60.00th=[   13],
     | 70.00th=[   16], 80.00th=[   19], 90.00th=[   25], 95.00th=[   29],
     | 99.00th=[   61], 99.50th=[   77], 99.90th=[  186], 99.95th=[  317],
     | 99.99th=[  542]
   bw (  KiB/s): min=  768, max=168320, per=100.00%, avg=83321.68, stdev=27333.02, samples=1200
   iops        : min=   12, max= 2630, avg=1301.88, stdev=427.08, samples=1200
  lat (msec)   : 2=0.01%, 4=32.71%, 10=20.61%, 20=29.94%, 50=15.16%
  lat (msec)   : 100=1.30%, 250=0.22%, 500=0.04%, 750=0.02%
  cpu          : usr=1.35%, sys=2.85%, ctx=699338, majf=0, minf=1725
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,781229,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=81.4MiB/s (85.3MB/s), 81.4MiB/s-81.4MiB/s (85.3MB/s-85.3MB/s), io=47.7GiB (51.2GB), run=600042-600042msec